'''

Механики:

Транспорт:
всевозможные виды.
сложная система повреждений и износа
упрощенный ремонт
(детали для ремонта ходовой/движка/электрической части/
электронной части/ латки для колес/ колеса)
необходимы навыки обслуживания или шарящие люди,
инструменты, в тяжелых случаях - мастерская

бартерная экономика;
услуга/товар и наоборот
топливо исключительно дорогое.

Здоровье
(обширная система повреждений)

Голод и жажда

Курение и алкоголизм

Система навыков

Лечение
(лекарства, травы, шины и т.д.)

Бой
(ближний, дальний, укрытия, защита
отдельных частей тела. Ближний должен
быть интересным, чтобы не стимулировать
игрока вечно бегать с пушкой. Дальний
бой сделать сложным, как для врага, так и для
игрока.)

Климат
Смена дня и ночи
Смена сезонов(достатотчно динамичная)


'''