'''
И так, я хочу написать что-то на подобе текстовой выживалки.
Сеттинг - Выживание в диких условиях (различные местности).
Время - 20 - 21 век


Сценарии - влияют на начальное снаряжение
и некоторые механики игры. Снаряжение зависит
от уровня сложности (легко, нормально, тяжело).

Потерявшийся турист:
- велотурист
- отбившийся от группы скалолаз
- каноист, чуть не утонул

Добровольный отшельник:
- путешественник (имеет фургон)
- аскет с минимумом снаряжения
- бомж (книга: гайд о выживании)

Пилот, потерпевший крушение:
- летчик-испытатель(милитари)
- почтовый самолет
- пионер авиаконструктор

Астронавт после посадки:
- астронавт МКС (в лесу)
- советский космонавт (в тайге)
- аварийное приводнение (океан)

Парашутист:
- Парапланер
- Спецназовец в тылу врага
- Раненый турист-экстремал

Беглый преступник:
- без палева сбежал
- спалили, преследуют
- военнопленный, истощён

Егерь:
- Лесничий (домик в глуши)
- Охотник (ружье, знает местность)
- Браконьер (скрывается от лесничих)


Профессии - начальные наборы навыков и характеристик.
Можно развивать любые навыки, но лишь выполняя определенные
действия. Скорость развития навыков зависит от профессии.
Некоторые сценарии не позволяют выбрать некоторые профессии.

Соц. служащий:
- врач
- полицейский
- пожарный

Рабочий:
- строитель
- грузчик
- дальнобойщик

Ученый:
- биолог
- геолог
- эколог

Инженер:
- Механик
- Электрик
- Айтишник

Военный:
- спецназ
- летчик
- моряк

Спортсмен:
- Велосипедист
- Бегун
- Атлет

Элита общества:
- топ-менеджер
- мажор
- частный предприниматель

Безработный:
- бездомный
- преступник
- человек не от мира сего


Местность:
Сетка случайно сгенерированного ландшафта:
Равнины, холмы, горы,
реки, озера, моря,
океан, архипелаг, джунгли,
леса, тайга, болота,
пустыня, саванна,
тундра, снега, ледники,
придумать еще что-то.

Города, села, деревни.
Обычно означают конец пути или
промежуточные пункты на пути к победе.

Охраняемые территории - всегда враждебные солдаты,
в некоторых сценариях - места, с которых необходимо
сбежать или проникнуть на них и оставаться там незамеченным.


Места интереса:
Пещеры, рудники, заброшенные шахты
Заброшенные и не очень строения:
ранчо, заводы, склады, электростанции
покинутые селения, хижины, другие отшельники
Дороги, жд пути, ЛЭП, которые могут привести к цивилизации,
а так же могут оказаться тупиковыми.


Ресурсы:
1. Природа
Дерево, камень,
железо, медь, серебро, золото, свинец (руды),
глина, песок, волокна, животные, рыба.

2. Крафт и лут
Деревянное, каменное, глиняное,
железное, стальное, цв. металл,
тканое, резиновое, пластиковое,
меховое, кожанное, костяное,
композитное, плетеное, продолжить...

3.1. Строительство (объекты)
Навес, палатка, землянка, хибара, хижина,
домик
Костер > печь > плавильня;
Склад > крытый склад > амбар
Стол > верстак > мастерская
Коробка, ящик, мебель, в т.ч.
для хранения



3.2. Строительство (ресурсы)
Соломенное, тростниковое,
деревянное, каменное, глиняное,
кирпичное, металлическое, плетеное,
покрытие, палаточное,


4.1 Механизмы:
Водяное колесо, ветряк,
лебедка, полиспаст, лифт, рычаг,
простой редуктор, ременной
редуктор, мельница, автомолот,
генератор, дополнить...

4.2 Компоненты механизмов
Лопасти, колесо, зубчатое колесо,
шкив, колесо с лопастями,
блок, вал, опора для колеса,
альтернатор от автомобиля, жернова,
ударная часть молота, дополнить...


Древесина:
1. Сырьё
- брёвна
- ветки
- палки
- листья
- смола

2. Изделия (крафт):
- дрова
- уголь
- пепел
- черенки
- инструменты (очень базовые)

3. Изделия (лут):
- доски
- мебель
- балки
- ящики

3. Металл:
- алюминий, латунь, (консервные банки, выплавка)
- другой цветмет (руды, выплавка)

Механики:

Транспорт:
всевозможные виды.
сложная система повреждений и износа
упрощенный ремонт
(детали для ремонта ходовой/движка/электрической части/
электронной части/ латки для колес/ колеса)
необходимы навыки обслуживания или шарящие люди,
инструменты, в тяжелых случаях - мастерская

бартерная экономика;
услуга/товар и наоборот
топливо исключительно дорогое.

Здоровье
(обширная система повреждений)

Голод и жажда

Курение и алкоголизм

Система навыков

Лечение
(лекарства, травы, шины и т.д.)

Бой
(ближний, дальний, укрытия, защита
отдельных частей тела. Ближний должен
быть интересным, чтобы не стимулировать
игрока вечно бегать с пушкой. Дальний
бой сделать сложным, как для врага, так и для
игрока.)

Климат
Смена дня и ночи
Смена сезонов(достатотчно динамичная)


'''