'''
И так, я хочу написать что-то на подобе текстовой выживалки.
Сеттинг - лайтовый постапокалипсис.
Время - современность.
Причина апокалипсиса - смертельный вирус (корона лол)

Предыстория:
Вспышка вируса несколько лет назад где-то в китайской провинции обернулась
пандемией для всего мира. Люди считали что если они создадут вакцины,
это поможет им выжить, но... от них было мало толку. Вирус мутировал и
приспосабливался быстрее, чем ученые находили лекарство против него.

Общество раскололось на несколько лагерей - те, кто предпочел "цивилизованную"
жизнь в карантинных условиях; в городах и укрепрайонах, охраняемых военными,
никогда не показываясь на улице без особых разрешений от властей. Зараженных
ликвидировали на месте. Трупы сжигали. В охраняемые територий никого не впускали
не под каким предлогом. Гуманитарные конвои проходили строгий санитарный контроль,
прежде чем попасть туда, и прежде чем покинуть их. Тем не менее, люди там со временем
полностью вымирали (по тем или иным причинам).

Страны существовали теперь лишь формально. Границы были, и пограничники стояли,
но за любой границей было более-менее то же самое - укрепрайоны, смерть, бандитизм,
дикость. Поэтому 'власти' представляли собой военизированные группировки, управляющие
охраняемыми территориями.

Многие попросту не выдерживали таких условий. Были те, кто бежал из городов в
малозаселенные местности. Одиночкам, семьям и даже группам беженцев разрешалось
навсегда покинуть охраняемые районы. Для 'властей' эти люди становились никем.
Они больше не принадлежали 'цивилизованному обществу'. Их судьбы были в их руках.
А стоило хоть одному человеку среди беженцев оказаться зараженным,
как в одну ночь погибали все.

Поэтому чаще всего выживали одиночки. Вирус передавался воздушно-капельным путем
и через выделения, заразиться в толчее было раз плюнуть. Буквально. Главный герой
как раз такой одиночка. Пока группы людей обустраивались в деревнях и вели крестьянский
образ жизни, одиночки уходили в малозаселенные глуши, много путешествовали и нарывались
на неприятности.

Как среди одиноких странников, так и среди групп беженцев со временем появились и
бандиты. Здесь думаю сильно распространяться не стоит, и так понятно, кто они такие.

Население:
НЕ зомби, НЕ мутанты, НЕ фантастическая хрень.

Дикие животные, бандиты, одиночки, солдаты (нейтральные и враждебные),
группы выживших (мирные) - Да.

Местность:
Сетка случайно сгенерированного ландшафта:
Равнины, холмы, горы
реки, озера, моря,
леса, пустыни, болота,
тундра, тайга.

Города, села, деревни, поселения (новые),
одиночные дома (пустые и обжитые)
разной степени разрушенности, населенности
и враждебности.

охраняемые территории(всегда враждебные солдаты).

объекты инфраструктуры:
шахты, склады, порты,
узлы логистики,
фермерские хозяйства,
электростанции, заводы.
Всё охраняется войсками или
контролируется бандитами.
Электричество где-то есть,
где-то нет. Будет со временем
пропадать полностью.
Интернет работает
там, где есть покрытие.


Механики:

Транспорт:
всевозможные виды.
сложная система повреждений и износа
упрощенный ремонт
(детали для ремонта ходовой/движка/электрической части/
электронной части/ латки для колес/ колеса)
необходимы навыки обслуживания или шарящие люди,
инструменты, в тяжелых случаях - мастерская

бартерная экономика;
услуга/товар и наоборот
топливо исключительно дорогое.

Здоровье
(обширная система повреждений)

Голод и жажда

Курение и алкоголизм

Система навыков

Лечение
(лекарства, травы, шины и т.д.)

Бой
(ближний, дальний, укрытия, защита
отдельных частей тела. Ближний должен
быть интересным, чтобы не стимулировать
игрока вечно бегать с пушкой. Дальний
бой сделать сложным, как для врага, так и для
игрока.)

Климат
Смена дня и ночи
Смена сезонов(достатотчно динамичная)


'''