'''
И так, я хочу написать что-то на подобе текстовой выживалки.
Сеттинг - Выживание в диких условиях (различные местности).
Время - 20 - 21 век


Сценарии - влияют на начальное снаряжение
и некоторые механики игры. Снаряжение зависит
от уровня сложности (легко, нормально, тяжело).

Потерявшийся турист:
- велотурист
- отбившийся от группы скалолаз
- каноист, чуть не утонул

Добровольный отшельник:
- путешественник (имеет фургон)
- аскет с минимумом снаряжения
- бомж (книга: гайд о выживании)

Пилот, потерпевший крушение:
- летчик-испытатель(милитари)
- почтовый самолет
- пионер авиаконструктор

Астронавт после посадки:
- астронавт МКС (в лесу)
- советский космонавт (в тайге)
- аварийное приводнение (океан)

Парашутист:
- Парапланер
- Спецназовец в тылу врага
- Раненый турист-экстремал

Беглый преступник:
- без палева сбежал
- спалили, преследуют
- военнопленный, истощён

Егерь:
- Лесничий (домик в глуши)
- Охотник (ружье, знает местность)
- Браконьер (скрывается от лесничих)


Профессии - начальные наборы навыков и характеристик.
Можно развивать любые навыки, но лишь выполняя определенные
действия. Скорость развития навыков зависит от профессии.
Некоторые сценарии не позволяют выбрать некоторые профессии.

Соц. служащий:
- врач
- полицейский
- пожарный

Ученый:
- биолог
- геолог
- эколог

Инженер:
- Механик
- Электрик
- Айтишник

Военный:
- спецназ
- летчик
- моряк

Спортсмен:
- Велосипедист
- Бегун
- Атлет

Безработный:
- бездомный
- преступник
- человек не от мира сего


Местность:
Сетка случайно сгенерированного ландшафта:
Равнины, холмы, горы
реки, озера, моря,
леса, пустыни, болота,
тундра, тайга.

Города, села, деревни, поселения (новые),
одиночные дома (пустые и обжитые)
разной степени разрушенности, населенности
и враждебности.

охраняемые территории(всегда враждебные солдаты).

объекты инфраструктуры:
шахты, склады, порты,
узлы логистики,
фермерские хозяйства,
электростанции, заводы.
Всё охраняется войсками или
контролируется бандитами.
Электричество где-то есть,
где-то нет. Будет со временем
пропадать полностью.
Интернет работает
там, где есть покрытие.


Механики:

Транспорт:
всевозможные виды.
сложная система повреждений и износа
упрощенный ремонт
(детали для ремонта ходовой/движка/электрической части/
электронной части/ латки для колес/ колеса)
необходимы навыки обслуживания или шарящие люди,
инструменты, в тяжелых случаях - мастерская

бартерная экономика;
услуга/товар и наоборот
топливо исключительно дорогое.

Здоровье
(обширная система повреждений)

Голод и жажда

Курение и алкоголизм

Система навыков

Лечение
(лекарства, травы, шины и т.д.)

Бой
(ближний, дальний, укрытия, защита
отдельных частей тела. Ближний должен
быть интересным, чтобы не стимулировать
игрока вечно бегать с пушкой. Дальний
бой сделать сложным, как для врага, так и для
игрока.)

Климат
Смена дня и ночи
Смена сезонов(достатотчно динамичная)


'''